class Пицца:
    
    def __init__(self):
        self.название = "Заготовка"
        self.тесто = "тонкое"
        self.соус = "кетчуп"
        self.начинка = []
        self.цена = 0

    def __str__(self):
        начинка_строка = ", ".join(self.начинка)
        return f"Пицца: {self.название} | Цена: {self.цена:.2f} р.\n" \
               f"Тесто: {self.тесто} Соус: {self.соус}\n" \
               f"Начинка: {начинка_строка}"

    def подготовить(self):
        начинка_строка = ", ".join(self.начинка)
        print(f"Начинаю готовить пиццу {self.название}")
        print(f"   - замешиваю {self.тесто} тесто...")
        print(f"   - добавляю соус: {self.соус}...")
        print(f"   - и, конечно: {начинка_строка}...")

    def испечь(self):
        print("Выпекаю пиццу... Готово!")

    def нарезать(self):
        print("Нарезаю на аппетитные кусочки...")

    def упаковать(self):
        print("Упаковываю в фирменную упаковку и готово!")


class ПиццаПепперони(Пицца): 
    def __init__(self):
        super().__init__()
        self.название = "Пепперони"
        self.тесто = "тонкое"
        self.соус = "томатный"
        self.начинка = ["пепперони", "сыр моцарелла"]
        self.цена = 350.00


class ПиццаБарбекю(Пицца):
    def __init__(self):
        super().__init__()
        self.название = "Барбекю"
        self.тесто = "тонкое"
        self.соус = "барбекю"
        self.начинка = ["бекон", "ветчина", "зелень", "сыр моцарелла"]
        self.цена = 450.00


class ПиццаДарыМоря(Пицца):
    def __init__(self):
        super().__init__()
        self.название = "Дары моря"
        self.тесто = "пышное"
        self.соус = "тар-тар"
        self.начинка = ["кальмары", "креветки", "мидии", "сыр моцарелла"]
        self.цена = 550.00